pub(crate) const CHINESE_NUMBERS: [[&str; 4]; 25] = [
    ["零", "零", "零", "零"],
    ["壹", "一", "壹", "一"],
    ["貳", "二", "贰", "二"],
    ["參", "三", "参", "三"],
    ["肆", "四", "肆", "四"],
    ["伍", "五", "伍", "五"],
    ["陸", "六", "陆", "六"],
    ["柒", "七", "柒", "七"],
    ["捌", "八", "捌", "八"],
    ["玖", "九", "玖", "九"],
    ["拾", "十", "拾", "十"],
    ["佰", "百", "佰", "百"],
    ["仟", "千", "仟", "千"],
    ["萬", "萬", "万", "万"],
    ["億", "億", "亿", "亿"],
    ["兆", "兆", "兆", "兆"],
    ["京", "京", "京", "京"],
    ["垓", "垓", "垓", "垓"],
    ["秭", "秭", "秭", "秭"],
    ["穰", "穰", "穰", "穰"],
    ["溝", "溝", "沟", "沟"],
    ["澗", "澗", "涧", "涧"],
    ["正", "正", "正", "正"],
    ["載", "載", "载", "载"],
    ["極", "極", "极", "极"],
];

pub(crate) const CHINESE_NUMBERS_CHARS: [[char; 4]; 25] = [
    ['零', '零', '零', '零'],
    ['壹', '一', '壹', '一'],
    ['貳', '二', '贰', '二'],
    ['參', '三', '参', '三'],
    ['肆', '四', '肆', '四'],
    ['伍', '五', '伍', '五'],
    ['陸', '六', '陆', '六'],
    ['柒', '七', '柒', '七'],
    ['捌', '八', '捌', '八'],
    ['玖', '九', '玖', '九'],
    ['拾', '十', '拾', '十'],
    ['佰', '百', '佰', '百'],
    ['仟', '千', '仟', '千'],
    ['萬', '萬', '万', '万'],
    ['億', '億', '亿', '亿'],
    ['兆', '兆', '兆', '兆'],
    ['京', '京', '京', '京'],
    ['垓', '垓', '垓', '垓'],
    ['秭', '秭', '秭', '秭'],
    ['穰', '穰', '穰', '穰'],
    ['溝', '溝', '沟', '沟'],
    ['澗', '澗', '涧', '涧'],
    ['正', '正', '正', '正'],
    ['載', '載', '载', '载'],
    ['極', '極', '极', '极'],
];

pub(crate) const CHINESE_NUMBERS_FRACTION: [[&str; 4]; 2] =
    [["角", "角", "角", "角"], ["分", "分", "分", "分"]];

pub(crate) const CHINESE_NUMBERS_FRACTION_CHARS: [[char; 4]; 2] =
    [['角', '角', '角', '角'], ['分', '分', '分', '分']];

pub(crate) const CHINESE_NEGATIVE_SIGN: [&str; 2] = ["負", "负"];

pub(crate) const CHINESE_NEGATIVE_SIGN_CHARS: [char; 2] = ['負', '负'];
